<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    
    <link href="/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<!--


<link href="/lib/font-awesome/css/font-awesome.min.css" rel="stylesheet" type="text/css" />
-->

<link rel="stylesheet" type="text/css" href="/lib/iconfont/iconfont.css">

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="读后感,企业管理,每周一书," />





  <link rel="alternate" href="/atom.xml" title="CG要塞" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />





<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '6397647998611883000',
      author: '江枫月'
    },
    algolia: {
      applicationID: '',
      apiKey: 'b064e71207194da6e9fad8d68a739c5e',
      indexName: 'jamesclarke_coding',
      hits: {"per_page":10},
      labels: {"input_placeholder":"输入关键字","hits_empty":"没有找到与“${query}”相关的内容","hits_stats":"${hits}条相关记录，共耗时${time} ms"}
    }
  };
</script>







  <title> 读《华为三十年》有感 | CG要塞 </title>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  


<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', '[object Object]', 'auto');
  ga('send', 'pageview');
</script>









  
    
    
      
    

    <div class="container one-collumn sidebar-position-left page-post-detail ">
          

        <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
          <div class="header-inner">


<div class="site-meta custom-logo">
  
    <div class="site-meta-headline">
      <a>
        <img class="custom-logo-image" src="/images/logo.png"
             alt="CG要塞"/>
      </a>
    </div>
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">CG要塞</span>
      <span class="logo-line-after"><i></i></span>
    </a>   
  </div>
  <p class="site-subtitle">Watch me take the lead!</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
          
        

        
        <li class="menu-item menu-item-Unity">                 
          <a  href="/Unity"  rel="section" >
            
              <i class="menu-item-icon iconfont icon-unity" ></i>
              
            Unity          
          </a>
          
            </li>
             
        
      
        
          
        

        
        <li class="menu-item menu-item-Hexo">                 
          <a  href="/Hexo"  rel="section" >
            
              <i class="menu-item-icon iconfont icon-hexo" ></i>
              
            Hexo          
          </a>
          
            </li>
             
        
      
        
          
        

        
        <li class="menu-item menu-item-OpenGL">                 
          <a  href="/OpenGL/"  rel="section" >
            
              <i class="menu-item-icon iconfont icon-opengl" ></i>
              
            OpenGL          
          </a>
          
            </li>
             
        
      
        
          
        

        
        <li class="menu-item menu-item-dropdown">                 
          <a  rel="section" >
            
              <i class="menu-item-icon iconfont icon-other" ></i>
              
            其他          
          </a>
          
            <ul class="sub-menu">
             
        
      
        
          
        

        
        <li class="menu-item menu-item-整体性学习">                 
          <a  href="/Learning/"  rel="section" >
            
              <i class="menu-item-icon iconfont icon-learning" ></i>
              
            整体性学习          
          </a>
          
            </li>
             
        
      
        
          
        

        
        <li class="menu-item menu-item-项目管理">                 
          <a  href="/PMP/"  rel="section" >
            
              <i class="menu-item-icon iconfont icon-pmp" ></i>
              
            项目管理          
          </a>
          
            </li>
             
        
      
        
          
        

        
        <li class="menu-item menu-item-阅想">                 
          <a  href="/categories/阅想/"  rel="section" >
            
              <i class="menu-item-icon iconfont icon-reading" ></i>
              
            阅想          
          </a>
          
            </li>
             
        
      
        
          
        

        
          </ul></li>
        
      
        
          
        

        
        <li class="menu-item menu-item-关于">                 
          <a  href="/about"  rel="section" >
            
              <i class="menu-item-icon iconfont icon-about" ></i>
              
            关于          
          </a>
          
            </li>
             
        
      

      
    </ul>
  

  
</nav>



<script src="http://libs.baidu.com/jquery/1.10.2/jquery.min.js"></script>
<script src="http://libs.baidu.com/bootstrap/3.0.3/js/bootstrap.js"></script>

<script src="/js/src/jquery.bootstrap-autohidingnavbar.min.js?v=5.1.0"></script>
<script src="/js/src/cookies.js"></script>
<script src="/js/src/category-list.js"></script>

<script>
    $(".header").autoHidingNavbar();
</script>



 </div>
          <div class="headband" id="headband"></div>   
        </header>


      <main id="main" class="main">
        <div class="main-inner">
          <div class="content-wrap">
            <div id="content" class="content">
                

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://jamesclarke.coding.me/2017/03/huawei30y/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="江枫月">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.gif">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="CG要塞">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="CG要塞" src="/images/logo.png">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                读《华为三十年》有感
              
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-03-29T23:52:25+08:00">
                2017-03-29
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/阅想/" itemprop="url" rel="index">
                    <span itemprop="name">阅想</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/hint.css/2.4.1/hint.min.css"><p>&#x200B;        &#x534E;&#x4E3A;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E2D;&#x56FD;&#x6700;&#x795E;&#x5947;&#x7684;&#x6C11;&#x8425;&#x4F01;&#x4E1A;&#xFF0C;&#x4E09;&#x5341;&#x5E74;&#x7684;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E3A;&#x65E0;&#x6570;&#x4EBA;&#x6D25;&#x6D25;&#x4E50;&#x9053;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x79D1;&#x6280;&#x5B9E;&#x529B;&#x3001;&#x5E02;&#x573A;&#x8425;&#x9500;&#x624B;&#x6BB5;&#x3001;&#x4EBA;&#x624D;&#x6218;&#x7565;&#x8FD8;&#x662F;&#x8D44;&#x672C;&#x8FD0;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x534E;&#x4E3A;&#x6709;&#x592A;&#x591A;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#x548C;&#x63A2;&#x7D22;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4ECA;&#x5929;&#x6211;&#x60F3;&#x5C31;&#x4F01;&#x4E1A;&#x7BA1;&#x7406;&#x8FD9;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8C08;&#x8C08;&#x5BF9;&#x300A;&#x534E;&#x4E3A;&#x4E09;&#x5341;&#x5E74;&#x300B;&#x4E00;&#x4E66;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<a id="more"></a>
<hr>
<p>&#x200B;        &#x534E;&#x4E3A;&#x662F;&#x4EFB;&#x6B63;&#x975E;&#x4E00;&#x624B;&#x521B;&#x529E;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x89C4;&#x5212;&#x548C;&#x6307;&#x5F15;&#x4E0B;&#xFF0C;&#x8301;&#x58EE;&#x6210;&#x957F;&#x8D77;&#x6765;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x534E;&#x4E3A;&#x4F01;&#x4E1A;&#x7BA1;&#x7406;&#x7406;&#x5FF5;&#x7684;&#x53D8;&#x5316;&#x4E0E;&#x4EFB;&#x6B63;&#x975E;&#x7BA1;&#x7406;&#x601D;&#x60F3;&#x7684;&#x53D1;&#x5C55;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x534E;&#x4E3A;&#x7ECF;&#x5386;&#x4E86;&#x4E09;&#x4E2A;&#x53D1;&#x5C55;&#x65F6;&#x671F;&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x7740;&#x4EFB;&#x6B63;&#x975E;&#x4E09;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x7BA1;&#x7406;&#x7406;&#x5FF5;&#x3002;&#x5728;&#x534E;&#x4E3A;&#x521D;&#x521B;&#x65F6;&#x671F;&#xFF0C;&#x4F01;&#x4E1A;&#x5C0F;&#xFF0C;&#x7BA1;&#x7406;&#x96BE;&#x5EA6;&#x4F4E;&#xFF0C;&#x5BF9;&#x5E02;&#x573A;&#x654F;&#x611F;&#x5EA6;&#x9AD8;&#xFF0C;&#x4E3B;&#x8981;&#x4F9D;&#x9760;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x4E2A;&#x4EBA;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x671F;&#xFF0C;&#x4EFB;&#x6B63;&#x975E;&#x4EE5;&#x6BDB;&#x6CFD;&#x4E1C;&#x7684;&#x6E38;&#x51FB;&#x6218;&#x3001;&#x201C;&#x519C;&#x6751;&#x5305;&#x56F4;&#x57CE;&#x5E02;&#x201D;&#x7B49;&#x601D;&#x60F3;&#x4E3A;&#x4E3B;&#xFF0C;&#x4EE5;&#x72FC;&#x6027;&#x7684;&#x4F5C;&#x98CE;&#x5F00;&#x7586;&#x6269;&#x571F;&#xFF0C;&#x5728;&#x6B8B;&#x9177;&#x7684;&#x5E02;&#x573A;&#x7ADE;&#x4E89;&#x4E2D;&#x4EE3;&#x9886;&#x534E;&#x4E3A;&#x51B2;&#x950B;&#x7A81;&#x56F4;&#xFF0C;&#x5EFA;&#x7ACB;&#x57FA;&#x4E1A;&#x3002;&#x8FDB;&#x5165;&#x5E73;&#x7A33;&#x53D1;&#x5C55;&#x671F;&#x540E;&#xFF0C;&#x534E;&#x4E3A;&#x6210;&#x4E3A;&#x4E2D;&#x578B;&#x4F01;&#x4E1A;&#xFF0C;&#x7BA1;&#x7406;&#x96BE;&#x5EA6;&#x63D0;&#x9AD8;&#xFF0C;&#x6B64;&#x65F6;&#x504F;&#x5411;&#x4E8E;&#x4F01;&#x4E1A;&#x81EA;&#x8EAB;&#x7684;&#x4F18;&#x5316;&#x548C;&#x91CD;&#x7EC4;&#x3002;&#x4EFB;&#x6B63;&#x975E;&#x5B66;&#x4E60;&#x4E86;&#x90ED;&#x58EB;&#x7EB3;&#x5BF9;IBM&#x7BA1;&#x7406;&#x6539;&#x9769;&#x7684;&#x6210;&#x529F;&#x7ECF;&#x9A8C;&#xFF0C;&#x5C06;IBM&#x7684;&#x7BA1;&#x7406;&#x5236;&#x5EA6;&#x79FB;&#x690D;&#x5230;&#x534E;&#x4E3A;&#x4E2D;&#xFF0C;&#x514B;&#x670D;&#x5B98;&#x50DA;&#x4F5C;&#x98CE;&#xFF0C;&#x4F18;&#x5316;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#xFF0C;&#x4F7F;&#x534E;&#x4E3A;&#x7EE7;&#x7EED;&#x505A;&#x5927;&#x505A;&#x5F3A;&#x3002;&#x5728;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x671F;&#xFF0C;&#x534E;&#x4E3A;&#x7684;&#x56FD;&#x9645;&#x5316;&#x8FDB;&#x7A0B;&#x52A0;&#x5FEB;&#xFF0C;&#x5728;&#x591A;&#x4E2A;&#x56FD;&#x5BB6;&#x5F00;&#x62D3;&#x4E86;&#x5E02;&#x573A;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E86;&#x7814;&#x53D1;&#x548C;&#x751F;&#x4EA7;&#x673A;&#x6784;&#xFF0C;&#x7BA1;&#x7406;&#x96BE;&#x5EA6;&#x8FDB;&#x4E00;&#x6B65;&#x52A0;&#x5927;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x7BA1;&#x7406;&#x4F53;&#x7CFB;&#x4E5F;&#x9700;&#x8981;&#x53D8;&#x9769;&#x3002;&#x4EFB;&#x6B63;&#x975E;&#x53C8;&#x5411;&#x7A3B;&#x76DB;&#x548C;&#x592B;&#x53D6;&#x7ECF;&#xFF0C;&#x4EE5;&#x963F;&#x7C73;&#x5DF4;&#x6A21;&#x5F0F;&#x518D;&#x9020;&#x534E;&#x4E3A;&#x7684;&#x7BA1;&#x7406;&#x67B6;&#x6784;&#xFF0C;&#x529B;&#x56FE;&#x4FDD;&#x6301;&#x534E;&#x4E3A;&#x7684;&#x7ADE;&#x4E89;&#x4F18;&#x52BF;&#x3002;&#x4EFB;&#x6B63;&#x975E;&#x901A;&#x8FC7;&#x5BF9;&#x4E09;&#x7C7B;&#x7BA1;&#x7406;&#x601D;&#x60F3;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x6539;&#x9020;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x534E;&#x4E3A;&#x72EC;&#x7279;&#x7684;&#x4F01;&#x4E1A;&#x6587;&#x5316;&#x548C;&#x7BA1;&#x7406;&#x7406;&#x5FF5;&#xFF0C;&#x5145;&#x5206;&#x5730;&#x8C03;&#x52A8;&#x4E86;&#x534E;&#x4E3A;&#x4EBA;&#x7684;&#x79EF;&#x6781;&#x6027;&#x548C;&#x521B;&#x9020;&#x6027;&#xFF0C;&#x771F;&#x6B63;&#x6FC0;&#x6D3B;&#x4E86;&#x4F01;&#x4E1A;&#x7684;&#x751F;&#x547D;&#x529B;&#xFF0C;&#x4F7F;&#x534E;&#x4E3A;&#x80FD;&#x591F;&#x9002;&#x5E94;&#x5E02;&#x573A;&#x7684;&#x53D8;&#x5316;&#x548C;&#x4F01;&#x4E1A;&#x7684;&#x6210;&#x957F;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x200B;        &#x6BCF;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x5728;&#x5E02;&#x573A;&#x4E0A;&#x7AD9;&#x7A33;&#x811A;&#x8DDF;&#x540E;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x505A;&#x5927;&#x505A;&#x5F3A;&#x3002;&#x800C;&#x6210;&#x4E3A;&#x5927;&#x4F01;&#x4E1A;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x4E00;&#x4E9B;&#x5927;&#x4F01;&#x4E1A;&#x7684;&#x5185;&#x90E8;&#x95EE;&#x9898;&#x5C31;&#x4F1A;&#x968F;&#x4E4B;&#x4EA7;&#x751F;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x4E3A;&#x7A81;&#x51FA;&#x4E5F;&#x662F;&#x6700;&#x4E3A;&#x6839;&#x6E90;&#x7684;&#x5C31;&#x662F;&#x5B98;&#x50DA;&#x4E3B;&#x4E49;&#x3002;&#x4E3A;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x7EC6;&#x5316;&#x5DE5;&#x4F5C;&#xFF0C;&#x5F3A;&#x5316;&#x7BA1;&#x7406;&#xFF0C;&#x5927;&#x4F01;&#x4E1A;&#x5F80;&#x5F80;&#x90E8;&#x95E8;&#x4F17;&#x591A;&#xFF0C;&#x51B3;&#x7B56;&#x94FE;&#x6761;&#x548C;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x52A0;&#x957F;&#xFF0C;&#x90E8;&#x95E8;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x8C03;&#x5DE5;&#x4F5C;&#x589E;&#x52A0;&#xFF0C;&#x5458;&#x5DE5;&#x7D27;&#x8FEB;&#x611F;&#x4E0B;&#x964D;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x90E8;&#x95E8;&#x5899;&#xFF0C;&#x9020;&#x6210;&#x51B3;&#x7B56;&#x5C42;&#x4E0D;&#x719F;&#x6089;&#x5E02;&#x573A;&#x7684;&#x53D8;&#x5316;&#x3001;&#x7BA1;&#x7406;&#x5C42;&#x4E92;&#x76F8;&#x63A8;&#x8BFF;&#x62D6;&#x5EF6;&#x3001;&#x6267;&#x884C;&#x5C42;&#x4E0D;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x54CD;&#x5E94;&#x5E02;&#x573A;&#x9700;&#x6C42;&#x53CA;&#x63D0;&#x4F9B;&#x6709;&#x6548;&#x670D;&#x52A1;&#xFF0C;&#x5BFC;&#x81F4;&#x4F01;&#x4E1A;&#x4E0A;&#x4E0B;&#x8131;&#x8282;&#x3001;&#x5DE6;&#x53F3;&#x8131;&#x94A9;&#xFF0C;&#x6574;&#x4F53;&#x964D;&#x4F4E;&#x6548;&#x7387;&#x548C;&#x6536;&#x76CA;&#x3002;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4EFB;&#x4F55;&#x5927;&#x4F01;&#x4E1A;&#x90FD;&#x4F1A;&#x5B58;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x534E;&#x4E3A;&#x8FD8;&#x662F;IBM&#x3002;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x80FD;&#x4E0D;&#x80FD;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x666E;&#x901A;&#x5458;&#x5DE5;&#x6709;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x89C9;&#x609F;&#x3002;&#x4EFB;&#x6B63;&#x975E;&#x5728;&#x53C2;&#x89C2;&#x6D74;&#x706B;&#x91CD;&#x751F;&#x7684;IBM&#x540E;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x58EE;&#x5927;&#x8D77;&#x6765;&#x7684;&#x534E;&#x4E3A;&#x4E5F;&#x4F1A;&#x5B58;&#x5728;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x6B64;&#x4ED6;&#x5411;&#x90ED;&#x793A;&#x7EB3;&#x53D6;&#x7ECF;&#xFF0C;&#x91CD;&#x91D1;&#x8058;&#x8BF7;IBM&#x7684;&#x987E;&#x95EE;&#x5BF9;&#x534E;&#x4E3A;&#x7684;&#x7BA1;&#x7406;&#x4F53;&#x7CFB;&#x8FDB;&#x884C;&#x518D;&#x9020;&#xFF0C;&#x4ECE;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x3001;&#x8D22;&#x52A1;&#x4F53;&#x7CFB;&#x3001;&#x7814;&#x53D1;&#x7CFB;&#x7EDF;&#x7B49;&#x591A;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x6DF1;&#x523B;&#x53D8;&#x9769;&#x3002;&#x7136;&#x800C;&#x53D8;&#x9769;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#x7684;&#x3002;&#x4EFB;&#x6B63;&#x975E;&#x5145;&#x5206;&#x8BA4;&#x8BC6;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x5236;&#x5EA6;&#x7684;&#x5EFA;&#x7ACB;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x88AB;&#x4F01;&#x4E1A;&#x540C;&#x5316;&#x548C;&#x5438;&#x6536;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#x4ED6;&#x91C7;&#x7528;&#x201C;&#x5148;&#x50F5;&#x5316;&#x540E;&#x4F18;&#x5316;&#x518D;&#x56FA;&#x5316;&#x201D;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x9010;&#x6B65;&#x5BF9;&#x5404;&#x90E8;&#x95E8;&#x8FDB;&#x884C;&#x6539;&#x9020;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#x5230;&#x5206;&#x6743;&#x5236;&#x8861;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x57FA;&#x5C42;&#x7684;&#x51B3;&#x7B56;&#x6743;&#x529B;&#x53CA;&#x8D23;&#x4EFB;&#xFF0C;&#x4E5F;&#x5C31;&#x6FC0;&#x53D1;&#x4E86;&#x66F4;&#x5E7F;&#x5927;&#x5458;&#x5DE5;&#x53C2;&#x4E0E;&#x4F01;&#x4E1A;&#x5EFA;&#x8BBE;&#x7684;&#x52A8;&#x529B;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x5C06;&#x5458;&#x5DE5;&#x548C;&#x4F01;&#x4E1A;&#x7ED1;&#x5B9A;&#x6210;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x3002;</p>
<p>&#x200B;        &#x9762;&#x5BF9;&#x5916;&#x90E8;&#x5E02;&#x573A;&#x8FC5;&#x731B;&#x53D8;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x4F01;&#x4E1A;&#x4E0D;&#x80FD;&#x5FEB;&#x901F;&#x7684;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x5C31;&#x4F1A;&#x50CF;&#x6218;&#x573A;&#x4E0A;&#x4E0D;&#x80FD;&#x5FEB;&#x901F;&#x53CD;&#x5E94;&#x7684;&#x90E8;&#x961F;&#x4E00;&#x6837;&#xFF0C;&#x88AB;&#x5BF9;&#x624B;&#x7ED9;&#x6B7C;&#x706D;&#x3002;&#x67EF;&#x8FBE;&#x3001;&#x8BFA;&#x57FA;&#x4E9A;&#x3001;&#x963F;&#x5C14;&#x5361;&#x7279;&#x7B49;&#x90FD;&#x662F;&#x524D;&#x8F66;&#x4E4B;&#x9274;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9762;&#x5BF9;&#x5168;&#x7403;&#x5316;&#x7684;&#x5E02;&#x573A;&#xFF0C;&#x534E;&#x4E3A;&#x91C7;&#x53D6;&#x963F;&#x7C73;&#x5DF4;&#x7684;&#x7ECF;&#x8425;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x65AD;&#x53D8;&#x9769;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#xFF0C;&#x5316;&#x5C0F;&#x5229;&#x6DA6;&#x4E2D;&#x5FC3;&#xFF0C;&#x7F29;&#x77ED;&#x51B3;&#x7B56;&#x94FE;&#xFF0C;&#x52A0;&#x5FEB;&#x51B3;&#x7B56;&#x901F;&#x5EA6;&#x3002;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB;&#x72EC;&#x7ACB;&#x6838;&#x7B97;&#x7684;&#x90E8;&#x95E8;&#x548C;&#x5206;&#x516C;&#x53F8;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x80FD;&#x591F;&#x7B80;&#x653F;&#x653E;&#x6743;&#xFF0C;&#x6FC0;&#x6D3B;&#x90E8;&#x95E8;&#x7684;&#x6D3B;&#x529B;&#x548C;&#x6548;&#x80FD;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x80FD;&#x591F;&#x53D1;&#x6325;&#x201C;&#x4EE5;&#x5C0F;&#x535A;&#x5927;&#x201D;&#x7684;&#x7ADE;&#x4E89;&#x4F18;&#x52BF;&#x3002;&#x6BCF;&#x4E2A;&#x5206;&#x516C;&#x53F8;&#x76F8;&#x5F53;&#x4E8E;&#x521D;&#x521B;&#x65F6;&#x671F;&#x7684;&#x534E;&#x4E3A;&#xFF0C;&#x5145;&#x5206;&#x53D1;&#x626C;&#x4E86;&#x534E;&#x4E3A;&#x7684;&#x201C;&#x72FC;&#x6027;&#x201D;&#x4F20;&#x7EDF;&#xFF0C;&#x5728;&#x5E02;&#x573A;&#x4E0A;&#x51B2;&#x950B;&#x9677;&#x9635;&#xFF0C;&#x540C;&#x65F6;&#x6BCD;&#x516C;&#x53F8;&#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x5168;&#x7403;&#x5316;&#x5E73;&#x53F0;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6574;&#x4E2A;&#x534E;&#x4E3A;&#x8FDB;&#x5316;&#x6210;&#x4E86;&#x6709;&#x4F17;&#x591A;&#x89E6;&#x987B;&#x7684;&#x6D77;&#x8475;&#xFF0C;&#x603B;&#x80FD;&#x591F;&#x5728;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x5730;&#x65B9;&#x7ED9;&#x5BF9;&#x624B;&#x4EE5;&#x731D;&#x4E0D;&#x53CA;&#x9632;&#x7684;&#x4E00;&#x51FB;&#x3002;</p>
<p>&#x200B;        &#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x534E;&#x4E3A;&#x7684;&#x4E0D;&#x540C;&#x53D1;&#x5C55;&#x65F6;&#x671F;&#xFF0C;&#x4EFB;&#x6B63;&#x975E;&#x6CA1;&#x6709;&#x56FA;&#x6267;&#x575A;&#x6301;&#x4E00;&#x79CD;&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x9762;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5E02;&#x573A;&#x548C;&#x4F01;&#x4E1A;&#x53D1;&#x5C55;&#x7279;&#x70B9;&#xFF0C;&#x601D;&#x8003;&#x5176;&#x4E2D;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x4E0D;&#x65AD;&#x5F15;&#x8FDB;&#x56FD;&#x5185;&#x5916;&#x7684;&#x5148;&#x8FDB;&#x7BA1;&#x7406;&#x7ECF;&#x9A8C;&#xFF0C;&#x878D;&#x5408;&#x4E2D;&#x56FD;&#x4F20;&#x7EDF;&#x6587;&#x5316;&#x7684;&#x7CBE;&#x534E;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x81EA;&#x521B;&#x601D;&#x7EF4;&#x7684;&#x5438;&#x6536;&#x548C;&#x751F;&#x5316;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x534E;&#x4E3A;&#x5F00;&#x653E;&#x3001;&#x5305;&#x5BB9;&#x3001;&#x8270;&#x82E6;&#x594B;&#x6597;&#x3001;&#x5B9E;&#x4E8B;&#x6C42;&#x662F;&#x7684;&#x4F01;&#x4E1A;&#x6587;&#x5316;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x4E86;&#x534E;&#x4E3A;&#x4E0D;&#x65AD;&#x4ECE;&#x4E00;&#x4E2A;&#x80DC;&#x5229;&#x8D70;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x80DC;&#x5229;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读后感/" rel="tag"># 读后感</a>
          
            <a href="/tags/企业管理/" rel="tag"># 企业管理</a>
          
            <a href="/tags/每周一书/" rel="tag"># 每周一书</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/03/hexo-generator/" rel="next" title="hexo-generator生成器">
                <i class="fa fa-chevron-left"></i> hexo-generator生成器
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/04/client-as-center/" rel="prev" title="读《以客户为中心》有感">
                读《以客户为中心》有感 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


            </div>
            


            
 <div class="comments" id="comments">
 <!-- 多说评论框 start -->

            <div id="uyan_frame"></div>
       
     </div>


          </div>
          
            
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
    
      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="江枫月" />
          <p class="site-author-name" itemprop="name">江枫月</p>
          <p class="site-description motion-element" itemprop="description">Watch me take the lead!</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/">
              <span class="site-state-item-count">7</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
    
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          
    
          
            <div class="site-state-item site-state-tags">
              
                <span class="site-state-item-count">8</span>
                <span class="site-state-item-name">标签</span>
              
            </div>
          
    
        </nav>
    
        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        
    
        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/jiangfengyue" target="_blank" title="GitHub">
                  
                    <i class="iconfont icon-github"></i>
                  
                  GitHub
                </a>
              </span>
            
          
        </div>


        
        
        
        
        
    
        
        <script type="text/javascript" charset="utf-8" src="/js/src/tagcloud.js"></script>
        <script type="text/javascript" charset="utf-8" src="/js/src/tagcanvas.js"></script>
        <div class="widget-wrap">
        	    <div id="myCanvasContainer" class="widget tagcloud">
                <canvas width="250" height="250" id="resCanvas" style="width=100%">
                    <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Canvas/">Canvas</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Git/">Git</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UI/">UI</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Unity/">Unity</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/VS-Code/">VS Code</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/企业管理/">企业管理</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/每周一书/">每周一书</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/读后感/">读后感</a><span class="tag-list-count">2</span></li></ul>
                </canvas>
            </div>
        </div>
        
    
        

    
      </section>
    
      
    
    </div>
  </aside>


          
        </div>
      </main>

      <footer id="footer" class="footer">
        <div class="footer-inner">
          <div class="copyright" >
  
  &copy;  2016 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-trophy"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">江枫月</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


          

          
        </div>
      </footer>

      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
      </div>
    </div>
  

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  




  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	



  

    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2129217"></script>
        <!-- UY END -->
    
  
  
  

  

  

  

  




</body>
</html>
